{
    "jokes":[
        ["Did you hear about the crook who stole a calendar? He got twelve months."],
        ["Did you hear about the semi-colon that broke the law? He was given two consecutive sentences."],
        ["A pig stands in front of an electric socket: “Oh no, who put you into that wall?!”"],
        ["A lot of people cry when they cut onions. The trick is not to form an emotional bond."],
        ["My cat just walked up to the paper shredder and said, “Teach me  everything you know.”"],
        ["There’s no “I” in denial.","-Peter Serafinowicz"],
        ["What are they planting to grow the seedless watermelon?","- Jerry Seinfeld"],
        ["You know it’s time to do the laundry when you dry off with a sneaker.","- Zach Galifianakis"],
        ["Every novel is a mystery novel if you never finish it."],
        ["What did the egg say to the comedian","You always crack me up :-)"],
        ["What do computers like to snack on?","Micro chips :-)"],
        ["How does a train eat?","It chew-chew"],
        ["Two muffics are in the oven. One says, \"Gosh, it's hot in here\"","The other replies, \"Oh my gosh, it's a talking muffin!\""],
        ["Did you hear about the new anti-gravity book?","Apparently you can't put it down. :-)"],
        ["I am normally shy, but after a cup of coffee I find I can express-o my feelings. :-D"],
        ["Why can't elephant use computers?","Because they're scared of the mouse. :-)"]
    ],
    "riddles":[
        ["Where are average things manufactured?","The satisfactory."],
        ["You find me in December, but not in any other month. What am I?","The letter D!"],
        ["I weigh nothing, but you can still see me. If you put me in a bucket, I make the bucket lighter. What am I?","A hole!"],
        ["What rock group consists of four famous men, but none of them sing?","The faces on Mount Rushmore!"],
        ["What five-letter word becomes shorter if you add two letters to it?","“Short” (add +”er”)!"],
        ["I’m the size of an elephant, but I weigh nothing. What am I?","An elephant’s shadow!"],
        ["Why is an island like the letter T?","They’re both in the middle of water!"],
        ["How many seconds are there in a year?","Twelve—January 2nd, February 2nd, March 2nd…"],
        ["How do you make the number one disappear?","Add the letter G and then presto—it’s Gone!"],
        ["There are three apples on a table and you take away two of them. How many apples do you have now?","Two, of course!"],
        ["How many cats can you put in an empty box?","One. After that, the box isn’t empty anymore."],
        ["What starts with “e,” ends with “e,” and contains one letter?","An envelope."],
        ["A man rode in to town on Tuesday, and left two days later on Tuesday. How so?","His horse is named Tuesday!"],
        ["What did zero say to eight?","Nice belt."],
        ["I am the beginning of the end, and the end of time and space. I am essential to creation, and I surround every place. Who am I?","The letter E."],
        ["What's a computer's least favourite food?","Spam"]        
    ]
}